In [1]:
import numpy as np
import pandas as pd

In [2]:
pets = pd.DataFrame({'sex': np.array(['M', 'M', 'F', 'M', 'F', 'F', 'F', 'M', 'F', 'M']),
                   'age': np.array([21, 45, 23, 56, 47, 70, 34, 30, 19, 62]),
                   'pets': np.array([['cat', 'dog'],
                                    ['hamster'],
                                    ['cat', 'gerbil'],
                                    ['fish', 'hamster', 'gerbil'],
                                    ['cat'],
                                    ['dog'],
                                    ['dog'],
                                    ['cat'],
                                    ['rabbit', 'cat'],
                                    ['dog']])})
dtype:object

C:\Users\charrie\AppData\Local\Temp\ipykernel_7060\838221901.py:3: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  'pets': np.array([['cat', 'dog'],

In [3]:
pets

  sex  age                     pets
0   M   21               [cat, dog]
1   M   45                [hamster]
2   F   23            [cat, gerbil]
3   M   56  [fish, hamster, gerbil]
4   F   47                    [cat]
5   F   70                    [dog]
6   F   34                    [dog]
7   M   30                    [cat]
8   F   19            [rabbit, cat]
9   M   62                    [dog]

In [4]:
#What sex was the youngest respondent?
pets.loc[lambda pets:pets['age']==19]

  sex  age           pets
8   F   19  [rabbit, cat]

In [5]:
pets.loc[pets['age']==19]

  sex  age           pets
8   F   19  [rabbit, cat]

In [6]:
pets.loc[pets['age']== min(pets['age'])]

  sex  age           pets
8   F   19  [rabbit, cat]

In [7]:
len(pets)

10

In [8]:
#create new column num_pets contain number of pets
#pets['num_pets'] = [2,1,2,3,1,1,1,1,2,1]
#pets = pets.assign(num_pets2 = lambda x: (x['pets'].len()))
#pets.drop(labels=['num_pets2'],axis=1, inplace=True)

In [9]:
pets['num_pets']= pets['pets'].str.len()
pets

  sex  age                     pets  num_pets
0   M   21               [cat, dog]         2
1   M   45                [hamster]         1
2   F   23            [cat, gerbil]         2
3   M   56  [fish, hamster, gerbil]         3
4   F   47                    [cat]         1
5   F   70                    [dog]         1
6   F   34                    [dog]         1
7   M   30                    [cat]         1
8   F   19            [rabbit, cat]         2
9   M   62                    [dog]         1

In [10]:
#view dataframe to check the new column is there
pets

  sex  age                     pets  num_pets
0   M   21               [cat, dog]         2
1   M   45                [hamster]         1
2   F   23            [cat, gerbil]         2
3   M   56  [fish, hamster, gerbil]         3
4   F   47                    [cat]         1
5   F   70                    [dog]         1
6   F   34                    [dog]         1
7   M   30                    [cat]         1
8   F   19            [rabbit, cat]         2
9   M   62                    [dog]         1

In [11]:
#What age was the person with the most pets?
pets.loc[pets['num_pets']== max(pets['num_pets']), 'age']

3    56
Name: age, dtype: int32

In [12]:
pet_series = pets['pets'].apply(pd.Series).stack().reset_index(drop=True)
pet_series

0         cat
1         dog
2     hamster
3         cat
4      gerbil
5        fish
6     hamster
7      gerbil
8         cat
9         dog
10        dog
11        cat
12     rabbit
13        cat
14        dog
dtype: object

In [13]:
#Produce an ordered count of each animal
#for index, row in pets.iterrows():
#    print(index,row['pets'])
#pet_series.loc[pet_series=='cat']
#pets['pets'].value_counts()
pet_series.value_counts()

cat        5
dog        4
hamster    2
gerbil     2
fish       1
rabbit     1
dtype: int64

In [14]:
#What ws the average age of dog owners?
'dog'in ['cat','dog'], 'dog'in ['dog'],

(True, True)

In [15]:
pets['hasdogs'] = pets['pets'].apply([lambda x: 'dog' in x])

In [16]:
pets.loc[pets['hasdogs'], 'age'].mean()

46.75

In [17]:
pets

  sex  age                     pets  num_pets  hasdogs
0   M   21               [cat, dog]         2     True
1   M   45                [hamster]         1    False
2   F   23            [cat, gerbil]         2    False
3   M   56  [fish, hamster, gerbil]         3    False
4   F   47                    [cat]         1    False
5   F   70                    [dog]         1     True
6   F   34                    [dog]         1     True
7   M   30                    [cat]         1    False
8   F   19            [rabbit, cat]         2    False
9   M   62                    [dog]         1     True